Revit 2027 API
ParameterTypeId.ToposurfacePointBasetypeEnum Property
 "Toposurface Point Base Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ToposurfacePointBasetypeEnum { get; }
Public Shared ReadOnly Property ToposurfacePointBasetypeEnum As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ToposurfacePointBasetypeEnum {
	ForgeTypeId^ get ();
}
static member ToposurfacePointBasetypeEnum : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace